app/Controllers/GestionEtudiant.php

SELECT *
FROM `etudiant`
---
  public function listsomeone()
  {
    $model = new EtudiantModel();
    $etudiants = $model->findAll();